{
    "Name": "Arabic MGB-3",
    "Subsets": [],
    "Link": "https://arabicspeech.org/resources/mgb3",
    "HF Link": "",
    "License": "unknown",
    "Year": 2017,
    "Language": "ar",
    "Dialect": "Egypt",
    "Domain": [
        "social media",
        "TV Channels"
    ],
    "Form": "spoken",
    "Collection Style": [
        "manual curation",
        "human annotation"
    ],
    "Description": "A multi-genre speech dataset for Arabic speech recognition and dialect identification. The ASR portion contains 16 hours of Egyptian Arabic from YouTube across seven genres. The dialect identification portion contains over 70 hours of speech from five major Arabic dialects (Egyptian, Levantine, Gulf, North African, MSA).",
    "Volume": 16,
    "Unit": "hours",
    "Ethical Risks": "Low",
    "Provider": [
        "QCRI"
    ],
    "Derived From": [
        "MGB-2"
    ],
    "Paper Title": "SPEECH RECOGNITION CHALLENGE IN THE WILD: ARABIC MGB-3",
    "Paper Link": "https://arxiv.org/abs/1709.07276",
    "Script": "Arab",
    "Tokenized": false,
    "Host": "other",
    "Access": "Upon-Request",
    "Cost": "",
    "Test Split": true,
    "Tasks": [
        "speech recognition"
    ],
    "Venue Title": "ASRU",
    "Venue Type": "workshop",
    "Venue Name": "IEEE Automatic Speech Recognition and Understanding Workshop",
    "Authors": [
        "Ahmed Ali",
        "Stephan Vogel",
        "Steve Renals"
    ],
    "Affiliations": [
        "Qatar Computing Research Institute, HBKU, Doha, Qatar",
        "Centre for Speech Technology Research, University of Edinburgh, UK"
    ],
    "Abstract": "This paper describes the Arabic MGB-3 Challenge – Arabic Speech Recognition in the Wild. Unlike last year’s Arabic MGB-2 Challenge, for which the recognition task was based on more than 1,200 hours broadcast TV news recordings from Aljazeera Arabic TV programs, MGB-3 emphasises dialectal Arabic using a multi-genre collection of Egyptian YouTube videos. Seven genres were used for the data collection: comedy, cooking, family/kids, fashion, drama, sports, and science (TEDx). A total of 16 hours of videos, split evenly across the different genres, were divided into adaptation, development and evaluation data sets. The Arabic MGB-Challenge comprised two tasks: A) Speech transcription, evaluated on the MGB-3 test set, along with the 10 hour MGB-2 test set to report progress on the MGB-2 evaluation; B) Arabic dialect identification, introduced this year in order to distinguish between four major Arabic dialects – Egyptian, Levantine, North African, Gulf, as well as Modern Standard Arabic. Two hours of audio per dialect were released for development and a further two hours were used for evaluation. For dialect identification, both lexical features and i-vector bottleneck features were shared with participants in addition to the raw audio recordings. Overall, thirteen teams submitted ten systems to the challenge. We outline the approaches adopted in each system, and summarise the evaluation results.",
    "annotations_from_paper": {
        "Name": 1,
        "Subsets": 1,
        "Link": 1,
        "HF Link": 0,
        "License": 0,
        "Year": 1,
        "Language": 1,
        "Dialect": 1,
        "Domain": 1,
        "Form": 1,
        "Collection Style": 1,
        "Description": 0,
        "Volume": 1,
        "Unit": 1,
        "Ethical Risks": 0,
        "Provider": 1,
        "Derived From": 1,
        "Paper Title": 1,
        "Paper Link": 0,
        "Script": 1,
        "Tokenized": 0,
        "Host": 0,
        "Access": 0,
        "Cost": 0,
        "Test Split": 1,
        "Tasks": 1,
        "Venue Title": 0,
        "Venue Type": 0,
        "Venue Name": 0,
        "Authors": 1,
        "Affiliations": 1,
        "Abstract": 1
    }
}